p = 29
g = 2
a = 23  
b = 13  

# Обчислення відкритих ключів
A = pow(g, a, p)  
B = pow(g, b, p) 

print(f"Вхідні дані: p = {p}, g = {g}, a = {a}, b = {b}")

# Обчислення спільного секрету
S_alice = pow(B, a, p)  
S_bob = pow(A, b, p)   

# Виведення результатів
print(f"Відкритий ключ Аліси A = {A}")
print(f"Відкритий ключ Боба B = {B}")
print(f"Спільний секрет з боку Аліси S = {S_alice}")
print(f"Спільний секрет з боку Боба S = {S_bob}")
print("Чи однакові значення секрету:", S_alice == S_bob)
